:PROPERTIES:
:ID:       6b1edb15-aca8-4aa8-8ffa-3332b428df1f
:END:
#+title: C: Dynamic Allocation
C Dynamic Memory Allocation can be defined as a procedure in which the size of a data structure (like Array) is changed during the runtime.

The /malloc function/ single argument specifies the number of bytes to allocate. If suc‐
cessful, it returns a pointer to memory allocated from the heap. If it fails, it returns a
null pointer.

** example:
#+begin_src C
  #include <stdlib.h>
  #include <stdio.h>
  #include <string.h>
  int main(){
    char *string1;
    char *string2;
    string1 = (char*) malloc(16);
    strcpy(string1, "0123456789AB");
    string2 = realloc(string1, 8);
    printf("string1  Value: %p [%s]\n", string1, string1);
    printf("string2  Value: %p [%s]\n", string2, string2);
  }
#+end_src

#+RESULTS:
| string1 | Value: | 0x5f7bb43a42a0 | [0123456789AB] |
| string2 | Value: | 0x5f7bb43a42a0 | [0123456789AB] |

WHY????
